Repository: 84000/data-translation-memory
Catalog: toh48-v4.tmx
Source language: bo
Languages: en

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་ཆོས་ཀྱི་གཏེར་གྱི་སྒྲ་ཐོས་ན་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟའོ། །
en: 63. “Vajrapramardin, if in a dream bodhisattvas hear the sound of a Dharma treasure, consider them to be on one of the first seven bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཉོན་མོངས་པ་མང་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་ཏེ།
en: Such bodhisattvas have many obscurations due to the afflictions, but few karmic obscurations.

source: དེས་ཡོངས་སུ་འདྲི་བའི་རང་བཞིན་ཅན་དུ་བྱ་ཞིང་དད་པས་མོས་པར་ཡང་བྱའོ། །
en: They should cultivate an inquisitive nature and faithfully engender reverence.

source: གང་གིས་བདག་གྲོང་ན་འདུག་པ་ན་ཆོས་ཀྱི་གཏེར་གྱི་སྒྲ་ཐོས་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas perceive themselves hearing the sound of a Dharma treasure while in a town, consider them to be on the first bhūmi.

source: གང་གིས་བདག་གནས་ཁང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they perceive it while in a residence, consider them to be on the second bhūmi.

source: གང་གིས་བདག་གཙུག་ལག་ཁང་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they perceive it while in a monastery, consider them to be on the third bhūmi.

source: གང་གིས་བདག་དགོན་པ་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they perceive it while in solitude, consider them to be on the fourth bhūmi.

source: གང་གིས་བདག་སྟན་ལ་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they perceive it while on a seat, consider those bodhisattvas to be on the fifth bhūmi.

source: གང་གིས་བདག་སྐྱེད་མོས་ཚལ་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they perceive it while in a pleasure garden, consider them to be on the sixth bhūmi.

source: གང་གིས་བདག་རིའི་རྩེ་མོ་ལ་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they perceive it while on a mountain summit, consider them to be on the seventh bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་སྔོན་མ་ཐོས་པའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་གྱི་དེ་བཞིན་གཤེགས་པའི་མཚན་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བརྒྱད་པོ་དག་ཏུ་ལུང་བསྟན་པ་ཡིན་ཏེ་ང་རྒྱལ་གྱི་དབང་གིས་ངེས་པར་འབྱུང་བར་འགྱུར་རོ། །
en: 64. “Vajrapramardin, if in a dream bodhisattvas hear the name of a tathāgata from another world system that they have never heard of before, those bodhisattvas are predicted to reside on any of the first eight bhūmis and will find release through the power of pride.

source: དེས་ནི་བདུད་ཀྱི་ལས་མང་དུ་ཉེ་བར་བསགས་ཤིང་དེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་མང་བ་ཡང་ཡིན་ནོ། །
en: Such bodhisattvas have come under the strong influence of Māra’s activity and have many karmic obscurations.

source: དེས་གལ་ཏེ་མཆོད་པར་འོས་པ་མཆོད་ཅིང་སྤྱོད་ལམ་བརྟགས་པ་མ་ཡིན་ན། དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར།
en: If they worship those who are worthy of worship and do not judge the actions of others, their related karmic obscurations will be purified and they will find release in awakening.

source: དེ་ལ་གཏོང་བ་ལ་ང་རྒྱལ་བྱེད་ན་ས་དང་པོ་པར་རོ། །
en: “If those bodhisattvas feel pride in their magnanimity, they are on the first bhūmi.

source: ཚུལ་ཁྲིམས་ལ་ང་རྒྱལ་བྱེད་ན་ས་གཉིས་པར་རོ། །
en: If they feel pride in their discipline, they are on the second bhūmi.

source: ཐོས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་གསུམ་པར་རོ། །
en: If they feel pride in their learning, they are on the third bhūmi.

source: མངོན་པར་བརྩོན་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་བཞི་བར་རོ། །
en: If they feel pride in their industriousness, they are on the fourth bhūmi.

source: ཡོ་བྱད་བསྙུངས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་ལྔ་པར་རོ། །
en: If they feel pride in their frugality, they are on the fifth bhūmi.

source: ཤེས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་དྲུག་པར་རོ། །
en: If they feel pride in their knowledge, they are on the sixth bhūmi.

source: སྤོབས་པ་ལ་ང་རྒྱལ་བྱེད་ན་ས་བདུན་པར་རོ། །
en: If they feel pride in their confident eloquence, they are on the seventh bhūmi.

source: བྱིན་གྱི་རླབས་ལ་ང་རྒྱལ་བྱེད་ན་ས་བརྒྱད་པར་རོ། །
en: If they feel pride in their blessings, they are on the eighth bhūmi.

source: བྱ་བ་ཐམས་ཅད་མཐར་ཕྱིན་པར་བྱེད་ན་ནི་ང་རྒྱལ་ཡིན་ནོ། །
en: ‘Pride’ entails reaching the culmination of all activities. 65.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་ཆེ་གེ་མོ་ཞེས་བྱ་བའི་མིང་ཐོས་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas hear the name of ‘so-and-so’ bodhisattva from ‘such-and-such’ world system, consider those bodhisattvas to be on one of the first five bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་བསམས་པ་དང་། ཉོན་མོངས་པ་ཆུང་བ་ཡིན་པར་རིག་པར་བྱའོ། །
en: You should recognize that those bodhisattvas are thought of by other bodhisattvas and have few obscurations due to the afflictions.

source: དེས་གལ་ཏེ་ལྷག་པའི་ང་རྒྱལ་མེད་པར་བྱས་ཤིང་ཉེ་དུ་རྣམས་ལ་ཡང་བཀུར་སྟི་ཆེར་བྱས་ན་དེས་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: If they rid themselves of excessive pride and deeply honor those close to them, their related karmic obscurations will be purified and they will find release in awakening.

source: གཟུངས་ཐོབ་པའི་མིང་ཐོས་ན་ས་དང་པོ་པར་འགྱུར་རོ། །
en: “If they hear the name of a bodhisattva who has obtained dhāraṇī, they are on the first bhūmi.

source: མངོན་པར་འབྱུང་བའི་ན་ས་གཉིས་པར་རོ། །
en: If they hear the name of one who has renounced, they are on the second bhūmi.

source: དཀའ་བ་སྤྱོད་པའི་ན་ས་གསུམ་པར་རོ། །
en: If they hear the name of one who practices austerities, they are on the third bhūmi.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བདུད་འདུལ་བར་བྱེད་པའི་ན་ས་བཞི་པར་རོ། །
en: If they hear the name of one who has subdued Māra at the seat of awakening, they are on the fourth bhūmi.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ན་ས་ལྔ་པར་རོ། །
en: If they hear the name of one who has obtained completely perfect awakening, they are on the fifth bhūmi.

source: མང་དུ་ཐོས་ཤིང་མཐོང་ནས་གོང་མར་ཡང་འགྱུར་རོ་གནས་མེད་ཅིང་ལྷག་པའི་བསམ་པ་ཉམ་ཆུང་བ་ཞིག་གི་ན་ས་དང་པོ་པར་བལྟའོ། །
en: If they both hear of and see such bodhisattvas repeatedly, they are on the higher bhūmis. If they hear the name of one who is unsteady and weak in their determined resolve, they are on the first bhūmi.

source: འགྱོད་པ་དང་བཅས་པར་གནས་པའི་ན་ས་གཉིས་པར་རོ། །
en: If they hear the name of one who is filled with remorse, they are on the second bhūmi.

source: སྡིག་པ་བྱེད་པའི་ན་ས་གསུམ་པར་རོ། །
en: If they hear the name of one who commits evil, they are on the third bhūmi.

source: མངོན་པར་བག་མེད་པའི་ན་ས་བཞི་པར་རོ། །
en: If they hear the name of one who is utterly careless, they are on the fourth bhūmi.

source: ཞི་གནས་མང་བའི་ན་ས་ལྔ་པར་རོ། །
en: If they hear the name of one who has much tranquility, they are on the fifth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྒྱ་མཚོའི་དབུས་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་བརྒྱད་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་ལུང་བསྟན་པར་བལྟ་སྟེ།
en: 66. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be in the middle of an ocean, recognize that those bodhisattvas are indicated as being on one of the first eight bhūmis.

source: དེས་ནི་ཐོས་པའི་མཐར་ཕྱིན་པར་བྱ་ཞིང་དེས་བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། ཤེས་རབ་ལ་མོས་པར་ཡང་བྱའོ། །
en: Such bodhisattvas should master their learning, be diligent, and be inspired toward insight.

source: གང་གིས་མ་ཕྱིན་པར་མཐོང་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas see that they are not moving, consider them to be on the first bhūmi.

source: གང་གིས་འགྲམ་དུ་སོན་པར་མཐོང་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they see that they have moved toward the shore, consider them to be on the second bhūmi.

source: གང་གིས་སྤང་ལེབ་ལ་འདུག་པར་མཐོང་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they see themselves on a plank of wood, consider them to be on the third bhūmi.

source: གང་གིས་ཀོ་གྲུར་ཞུགས་པ་མཐོང་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they see themselves getting into a boat made of skins, consider them to be on the fourth bhūmi.

source: གང་གིས་གྲུ་ན་འདུག་པར་མཐོང་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If they see themselves seated in a boat, consider them to be on the fifth bhūmi.

source: གང་གིས་ཆུ་ན་འདུག་པར་མཐོང་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: If they see themselves in the water, consider them to be on the sixth bhūmi.

source: གང་གིས་གྲུ་ན་འགྲེང་བར་མཐོང་ན་དེ་ནི་ས་བདུན་པར་རོ། །
en: If they see themselves standing up in a boat, consider them to be on the seventh bhūmi.

source: གང་གིས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་བཀང་བའི་གྲུ་ཕ་རོལ་ཏུ་སྒྲོལ་བར་མཐོང་ན་དེ་ནི་ས་བརྒྱད་པར་རོ། །
en: If they see themselves escaping to the far shore in a boat filled with every jewel, consider them to be on the eighth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རིན་པོ་ཆེ་དག་ཐུ་བར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་གསུམ་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ། །
en: 67. “Vajrapramardin, if in a dream bodhisattvas perceive themselves collecting jewels, consider those bodhisattvas to be on one of the first three bhūmis.

source: དེ་ལ་ནི་རྣམ་པར་མཐོ་འཚམ་པ་མང་ཞིང་དཀར་པོའི་ཆོས་རྣམས་ཀྱང་སྡུག་བསྔལ་བས་ཡང་དག་པར་འཐོབ་པར་འགྱུར་ཏེ།
en: Such bodhisattvas have experienced a lot of harm and have acquired virtuous qualities through suffering.

source: དེས་ཆོས་འདོད་པར་བྱ་ལ། ཆོས་སྨྲ་བ་དག་ལ་འཁྲུལ་པ་མི་བཙལ་ཞིང་བྱས་པ་གཟོ་བར་ཡང་བྱའོ། །
en: They should desire the Dharma, try not to vex Dharma teachers, and be appreciative of what they have done.

source: གང་གིས་ས་བརྐོས་ནས་རིན་པོ་ཆེ་དག་རྙེད་ན། དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they find jewels that have been unearthed, consider them to be on the first bhūmi.

source: གང་གིས་ས་རྡུལ་དང་འདྲེས་པ་རྙེད་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they find jewels mixed with dirt, consider them to be on the second bhūmi.

source: གང་གིས་རྩྭ་དང་འདྲེས་པ་རྙེད་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they find jewels mixed with grass, consider them to be on the third bhūmi.

source: མངོན་པར་བརྩོན་པ་དག་གི་མཚན་མ་ནི་དེ་དག་ཡིན་གྱི།
en: These are the signs for those who are industrious.

source: མངོན་པར་མི་བརྩོན་པ་དག་ལ་ནི་བདུད་ཀྱི་ལས་དག་ཀྱང་ཡོད་དེ་ལྷག་པར་ཡང་ས་དྲུག་པ་ལ་འབྱུང་ངོ་། །
en: For those who are not industrious, these signs could be the work of Māra, especially if they occur to bodhisattvas on the sixth bhūmi.

source: ས་བཞི་པ་ལ་མི་བརྩོན་པ་དང་ལྡན་པ་དག་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ལས་མ་གྲོལ་བ་ཡིན་ནོ། །
en: Those on the fourth bhūmi who lack effort are not free of the activity of Māra or karmic obscurations. 68.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རི་རབ་ཀྱི་རྩེ་མོར་སོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ལས་ཕྱིར་མི་ལྡོག་པར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves reaching the summit of Mount Meru, recognize that those bodhisattvas will not regress from the first five bhūmis.

source: དེ་ལ་ནི་སྡིག་པའི་གྲོགས་པོའི་དབང་དང་། གཡོལ་བསྟེན་པ་དང་།
en: Such bodhisattvas came under the sway of evil companions, relied on deceit, and were often uninspired.

source: མ་མོས་པ་མང་བས་ཡོན་ཏན་གང་ཡིན་པ་དག་ཅུང་ཟད་ཀྱང་མི་སྐྱེ་སྟེ།
en: Therefore, they only produce a few good qualities.

source: དེས་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པར་བྱ་ཞིང་གཡོ་མེད་པ་དང་མོས་པ་མང་དུ་ཡང་བྱའོ། །
en: They should serve a spiritual guide, be guileless, and regularly cultivate inspiration.

source: གང་གིས་བདག་རི་རབ་ལ་འཛེག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དྲུག་པར་རོ། །
en: “If they perceive themselves climbing to Mount Meru’s summit, they are on the sixth bhūmi.

source: འཛེགས་ཏེ་འགྲེང་ན་ས་བདུན་པར་རོ། །
en: If they ascend and then stand up, they are on the seventh bhūmi.

source: བདག་ཕྱོགས་བཞིར་རྣམ་པར་ལྟ་ན་ས་བརྒྱད་པར་རོ། །
en: If they look to the four directions, they are on the eighth bhūmi.

source: འདུག་ན་ས་དགུ་པར་རོ། །
en: If seated, they are on the ninth bhūmi.

source: སྒུལ་བར་བྱེད་ན་ས་བཅུ་པར་རོ། །
en: If they cause the summit to shake, they are on the tenth bhūmi.

source: ས་དང་པོ་ནས་ས་བདུན་པའི་བར་དག་གིས་ནི་མངོན་པར་བརྩོན་པ་འམ། བསམ་པ་ཕུན་སུམ་ཚོགས་པ་འམ། དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ཏུ་སོན་པ་འམ། བདུད་ཀྱི་ལས་ཀྱིས་མཐོང་བར་འགྱུར་རོ། །
en: Bodhisattvas on the first to the seventh bhūmis who are industrious, have excellent intention, or are under the care of a spiritual guide will see these signs as the work of Māra.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རི་ལ་འཛེག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་ལྔ་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 69. “Vajrapramardin, if in a dream bodhisattvas perceive themselves ascending a mountain, consider those bodhisattvas to be on one of the first five bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་རྣམ་པ་ཐམས་ཅད་དུ་གནོད་པ་དག་ཀུན་འབྱུང་བར་འགྱུར་རོ། །
en: Such bodhisattvas have experienced harm of every type.

source: དེས་ནི་ཆོས་སྨྲ་བ་ལ་བརྙས་པར་བྱས་པ་ཡིན་པས་དེས་དངོས་པོ་ཐམས་ཅད་སྦ་བ་མེད་པར་བྱའོ། །
en: Because they have disparaged Dharma teachers, they should be open with all of their possessions.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་ཏེ།
en: By doing so, their related karmic obscurations will be purified and they will find release in awakening.

source: ས་དང་པོ་ལ་ནི་ཕུང་པོ་གསུམ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་གདོན་པར་བྱའོ། །
en: “On the first bhūmi, those bodhisattvas should recite the Three Sections Dharma discourse.

source: ས་གཉིས་པ་ལ་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བྱའོ། །
en: On the second bhūmi, they should train in recollecting the Buddha.

source: ས་གསུམ་པ་ལ་ནི་སྟོང་པ་ཉིད་བསྒོམ་པར་བྱའོ། །
en: On the third bhūmi, they should cultivate emptiness.

source: ས་བཞི་པ་ལ་ནི་སྙིང་རྗེ་ཆེན་པོ་བསྒོམ་པར་བྱའོ། །
en: On the fourth bhūmi, they should cultivate great compassion.

source: ས་ལྔ་པ་ལ་ནི་ལྷག་མཐོང་བསྒོམ་པར་བྱའོ། །
en: On the fifth bhūmi, they should engage in insight meditation.

source: གང་གིས་བདག་རི་ལ་འཛེག་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas perceive themselves ascending a mountain, consider them to be on the first bhūmi.

source: གང་གིས་དབུས་སུ་ཕྱིན་ན་དེ་ནི་ས་གཉིས་པར་རོ། །
en: If they have reached the midpoint, consider them to be on the second bhūmi.

source: གང་གིས་རྩེ་མོར་ཕྱིན་ན་དེ་ནི་ས་གསུམ་པར་རོ། །
en: If they have reached the summit, consider them to be on the third bhūmi.

source: གང་མངོན་པར་ལྟ་བར་བྱེད་ན་དེ་ནི་ས་བཞི་པར་རོ། །
en: If they are looking out from the mountain, consider them to be on the fourth bhūmi.

source: གང་འདུག་ན་དེ་ནི་ས་ལྔ་པར་རོ། །
en: If seated, consider them to be on the fifth bhūmi. 70.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རིའི་རྩེ་མོ་ན་འདུག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves on a mountain peak, consider those bodhisattvas to be on one of the first seven bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ནི་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་ལ་བདུད་ཀྱི་ལས་ཤས་ཆེ་བ་ཡིན་པས་དེས་ནི་སྡུག་པའི་དངོས་པོ་ཡོངས་སུ་གཏང་བར་བྱ་ཞིང་ཉེ་དུ་ཡང་མཆོད་པར་བྱ། ཉེ་དུ་གཞན་དག་ཀྱང་དགའ་བར་བྱའོ། །
en: Such bodhisattvas possess few karmic obscurations but are predominantly affected by Māra’s activity. They should therefore give up their beloved possessions, honor their relations, and please others who are close to them.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་བ་དེ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their related karmic obscurations will be purified and they will find release in awakening.

source: རི་ཆེན་པོ་བདུན་པོ་དག་ནི་ས་བདུན་པོ་རྣམས་ཀྱི་འོ། །རི་རབ་ནི་ས་ལྷག་མ་རྣམས་ཀྱིའོ། །
en: The seven great mountains correspond to the seven bhūmis, while Mount Meru corresponds to the remaining bhūmis. 71.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་ཤིང་ལྗོན་པ་ལ་འཛེག་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be climbing a tree, consider those bodhisattvas to be on one of the first four bhūmis.

source: དེ་ལ་ནི་བདུད་ཀྱི་ལས་དང་ལས་ཀྱི་སྒྲིབ་པ་ཡང་འབྲིང་ཙམ་སྟེ།
en: Such bodhisattvas are only moderately influenced by the activity of Māra and have a moderate amount of karmic obscurations.

source: དེས་ནི་དགེ་བའི་བཤེས་གཉེན་གང་དག་སྣང་བ་ཐོབ་པ་རྣམས་དང་། གང་དག་གིས་དུས་དུས་སུ་དེའི་ཆོས་ཀྱི་ཐེ་ཚོམ་སེལ་བར་ནུས་པའི་དགེ་བའི་བཤེས་གཉེན་དག་ལ་བསྟེན་པར་བྱའོ། །
en: They should rely on spiritual guides who have achieved illumination, and from time to time also rely on spiritual guides who are able to clear away their doubts about the Dharma.

source: དེ་ལ་གྲིབ་ཤིང་ལོ་མ་ཕུན་སུམ་ཚོགས་པ་ལ་འཛེགས་ན་ས་དང་པོར་རོ། །
en: “If those bodhisattvas climb a shade tree with an abundance of leaves, they are on the first bhūmi.

source: སྤོས་ཀྱི་ཤིང་ལ་ན་ས་གཉིས་པར་རོ། །
en: If it is a fragrant tree, they are on the second bhūmi.

source: མེ་ཏོག་གི་ཤིང་ལ་ན་ས་གསུམ་པར་རོ། །
en: If it is a flowering tree, they are on the third bhūmi.

source: འབྲས་བུའི་ཤིང་ལ་ན་ས་བཞི་པར་ཏེ།
en: If it is a fruit tree, they are on the fourth bhūmi.

source: མངོན་པར་བརྩོན་པ་དག་གི་མཚན་མ་དེ་དག་ཡིན་གྱི་མངོན་པར་མི་བརྩོན་པ་དག་ལ་ནི་བདུད་ཀྱི་ལས་ཀྱང་ཡོད་དོ། །
en: These are the signs for those who are industrious, but are the work of Māra for those who are not industrious.

source: ས་གོང་མ་པ་དག་གིས་ནི་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པའི་ཤིང་ལྗོན་པ་དག་མཐོང་བར་འགྱུར་ཏེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་མ་གཏོགས་སོ། །
en: Those on higher bhūmis see trees that are abundant in every way, unless the signs are the ripening of karma.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་གླང་པོ་ཆེའི་གཙོ་བོ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་དྲུག་པོ་དག་ལས་ས་གང་ཡང་རུང་བར་བལྟ་སྟེ།
en: 72. “Vajrapramardin, if in a dream bodhisattvas see the best of elephants, consider those bodhisattvas to be on one of the first six bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་སྦྱིན་པ་སྤྱད་པ་ལྟར་ཤེས་རབ་དེ་ལྟར་མ་སྤྱད་པས་དེ་ལ་དགེ་བའི་རྩ་བ་དག་དཀའ་བས་སྐྱེ་བར་འགྱུར་ཏེ།
en: Such bodhisattvas have not trained in insight in the same way they trained in generosity, and thus find it difficult to produce roots of virtue.

source: དེས་ནི་དད་པར་བྱ་ཞིང་ངེས་པར་བརྟག་པ་མང་དུ་ཡང་བྱའོ། །
en: They should cultivate faith and frequently engage in investigation.

source: དེ་ལ་གླང་པོ་ཆེའི་གཙོ་བོ་ཡོངས་སུ་མ་དག་པ་མཐོང་ན་ས་དང་པོར་རོ། །
en: “If they see the best of elephants when it is unclean, they are on the first bhūmi.

source: ཐལ་ཀར་མཐོང་ན་ས་གཉིས་པར་རོ། །
en: If they see one that is clean, they are on the second bhūmi.

source: མཆེ་བ་དྲུག་པ་མཐོང་ན་ས་གསུམ་པར་རོ། །
en: If they see one with six tusks, they are on the third bhūmi.

source: རྒྱན་གྱིས་བརྒྱན་པ་མཐོང་ན་ས་བཞི་པར་རོ། །
en: If they see one adorned with ornaments, they are on the fourth bhūmi.

source: རྒྱལ་མཚན་དང་། གདུགས་ཐོགས་པ་མཐོང་ན་ས་ལྔ་པར་རོ། །
en: If they see one adorned with a banner and parasol, they are on the fifth bhūmi.

source: སྒྲ་འབྱིན་པར་མཐོང་ན་ས་དྲུག་པར་རོ།། །།
en: If they see one that is trumpeting, they are on the sixth bhūmi.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བདུན་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 73. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be riding the best of elephants, consider those bodhisattvas to be on one of the first seven bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་དགོངས་ཤིང་དེ་ལ་ཡེ་ཤེས་འཇུག་པ་དང་། དབང་ཕྱུག་ཆེན་པོ་ཡང་ཡོད་པ་ཡིན་པས་དེས་ན་གུས་པ་དང་བཅས་པ་དང་།
en: Such bodhisattvas are just one birth away from awakening, are thought of by the thus-gone, worthy, completely perfect buddhas, and are introduced to knowledge by them as well as by Maheśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་འཛིན་དུ་གཞུག་པ་དང་། རྒྱུ་མེད་པ་དང་། ངན་ངོན་ཙམ་གྱིས་ཆོག་ཤེས་པ་དང་། ཡིད་དུ་འཐད་པ་སྦྱིན་པར་བྱའོ། །
en: Those bodhisattvas should therefore be respectful, enter into the care of the bodhisattvas, be guileless, be content with basic necessities, and give away those things that please them.

source: དེས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པར་འགྱུར་ཞིང་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་ཡང་འགྱུར་རོ། །
en: By doing so, their related karmic obscurations will be purified and they will find release in awakening.

source: གང་གིས་བདག་གླང་པོ་ཆེའི་གཙོ་བོ་ཐ་མལ་པ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་དང་པོ་པར་བལྟའོ། །
en: “If they perceive themselves riding on the best of elephants that is unremarkable, consider them to be on the first bhūmi.

source: གང་གིས་གོས་དཀར་པོ་བགོས་ཏེ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་དེ་ནི་ས་གཉིས་པར་བལྟའོ། །
en: If they are wearing white clothes while riding it, consider them to be on the second bhūmi.

source: གང་གིས་ཚོན་དམར་པོ་ཅན་བགོས་ཏེ་ན་དེ་ནི་ས་གསུམ་པར་བལྟའོ། །
en: If they are wearing red clothes, consider them to be on the third bhūmi.

source: གང་གིས་ཚོན་སྣ་ཚོགས་ཅན་བགོས་ཏེ་ན་དེ་ནི་ས་བཞི་པར་བལྟའོ། །
en: If they are wearing multicolored clothes, consider them to be on the fourth bhūmi.

source: གང་གིས་དྲི་ཞིམ་པོས་ཁ་བསྒྱུར་བའི་གོས་དག་བགོས་ཤིང་རྒྱན་གྱིས་བརྒྱན་ཏེ་ན་དེ་ནི་ས་ལྔ་པར་བལྟའོ། །
en: If they are wearing perfumed clothes and ornaments, consider them to be on the fifth bhūmi.

source: གང་གིས་ཅོད་པན་ཐོགས་ཏེ་ན་དེ་ནི་ས་དྲུག་པར་བལྟའོ། །
en: If they are wearing a crown, consider them to be on the sixth bhūmi.

source: གང་གིས་རྒྱན་གྱིས་བརྒྱན་པའི་གདུགས་ཐོགས་ཏེ་ན་དེ་ནི་ས་བདུན་པར་བལྟའོ། །
en: If they are holding a jeweled parasol, consider them to be on the seventh bhūmi.

source: ས་གོང་མ་པ་དག་གིས་ནི་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཐོང་སྟེ། ལས་ཀྱི་སྒྲིབ་པ་དང་། མངོན་པར་མི་བརྩོན་པ་ནི་མ་གཏོགས་སོ། །
en: Those on the higher bhūmis see signs that are abundant in every way, unless they are due to karmic obscurations, or they are not industrious.

source: རྡོ་རྗེས་རབ་འཇོམས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་རྨི་ལམ་ན་བདག་རྟ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ས་དང་པོ་བཞི་པོ་དག་ཏུ་བལྟ་སྟེ།
en: 74. “Vajrapramardin, if in a dream bodhisattvas perceive themselves to be riding a horse, consider those bodhisattvas to be on one of the first four bhūmis.

source: དེས་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་པར་བྱའོ། །
en: They should focus on the perfection of discipline.

source: དེ་ལ་ནི་བདུད་ཀྱི་ལས་ཤས་ཆེ་ལ་ལས་ཀྱི་སྒྲིབ་པ་ཆུང་བ་ཡིན་པས་དེས་སྟོང་པ་ཉིད་གཙོ་བོར་བྱ་བ་དང་། ལྷག་མཐོང་མང་དུ་བྱ་བ་དང་། ནན་ཏན་གྱིས་བསྒྲུབ་པར་བྱའོ། །
en: Because they are predominantly affected by the activity of Māra but have few karmic obscurations, they should emphasize emptiness, consistently engage in the practice of insight meditation, and practice earnestly.

source: དེ་ལ་བདག་རྟ་འགྲེང་བ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་ས་དང་པོ་པར་བལྟའོ། །
en: “If those bodhisattvas perceive themselves riding a horse that is standing still, consider them to be on the first bhūmi.

source: འགྲོ་བ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་ས་གཉིས་པར་བལྟའོ། །
en: If they perceive themselves riding a horse that is moving, consider them to be on the second bhūmi.

source: རྒྱུག་པ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་ས་གསུམ་པར་བལྟའོ། །
en: If they perceive themselves riding a horse that is running, consider them to be on the third bhūmi.

source: བརྒྱན་པ་ལ་ཞོན་པར་ཀུན་ཏུ་ཤེས་ན་ས་བཞི་པར་བལྟ་སྟེ། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: If they perceive themselves riding a decorated horse, consider them to be on the fourth bhūmi. These are the signs, unless they are the activity of Māra.

source: ས་གོང་མ་དག་ལ་ནི་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་མཐོང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་ང་རྒྱལ་ཅན་རྣམས་དང་། བདུད་ཀྱི་ལས་ནི་མ་གཏོགས་སོ། །
en: Those who reside on higher bhūmis will see such signs in great abundance, unless the bodhisattvas are conceited or influenced by the actions of Māra.
